[
  {
    "url": "project-AMHA.html",
    "name": "AMHA",
    "nameEN": "Asian Malignant Hyperthermia Alliance (AMHA)",
    "summary": "本專案為 亞洲惡性高熱聯盟（AMHA） 官方網站的前端靜態網頁製作。該聯盟是一個致力於應對惡性高熱（Malignant Hyperthermia, MH）的國際非營利醫療組織。專案內容包含完整的 HTML 架構與 CSS 樣式整合，設計素材由原設計方提供，本人負責將視覺設計轉化為符合跨平台瀏覽需求的前端程式碼，呈現清晰且專業的醫療資訊形象網站。",
    "summaryEN": "This project is the official website for the Asia Malignant Hyperthermia Alliance (AMHA), a non-profit organization dedicated to addressing Malignant Hyperthermia (MH). The scope of work included the complete development of static front-end code, comprising structured HTML and integrated CSS styles. Visual assets were provided by the original designer. My responsibility was to transform the provided design into responsive and accessible code, ensuring a clean and professional presentation of medical information for diverse platforms.",
    "thumbnail": "AMHA/AMHA.jpg",
    "webUrl": "https://google.com"
  },
  {
    "url": "project-dr.html",
    "name": "Dr. 美胸",
    "nameEN": "Dr. Perfect Curve",
    "summary": "「Dr.美胸」網站切版作品集，內容包含已完成之 HTML 結構、CSS 樣式、動畫效果與展示頁面，設計素材由原設計方提供。此作品展現本人於靜態切版與前端互動畫面製作方面的技術能力，適用於品牌網站、電商頁面或醫美保健領域的前端開發參考。",
    "summaryEN": "“Dr. Beautiful Bust” website front-end work. It includes completed HTML structure, CSS styling, animation effects, and demo pages. All visual assets were provided by the original design team. This project highlights my skills in static layout implementation and front-end animation, suitable for brand websites, e-commerce pages, or beauty and wellness web development references.",
    "thumbnail": "dr/dr.jpg",
    "webUrl": "https://google.com"
  },
  {
    "url": "project-YunfeisChoice.html",
    "name": "雲飛健康寶盒",
    "nameEN": "Yunfei's Choice",
    "summary": "網站前端靜態作品包，內容包含單頁式網站的 HTML 架構、CSS 樣式與完整圖片素材，展現商品視覺導向頁面的切版與互動動畫整合能力。設計素材由原設計方提供，本人負責靜態切版與前端動畫效果製作，適用於品牌形象頁等案例展示。",
    "summaryEN": "This front-end static site package includes a single-page website with HTML structure, CSS styling, and complete visual assets. It showcases the ability to implement visually-driven product layouts and integrate interactive animation effects. All design materials were provided by the original design team. I was responsible for static layout development and front-end animation. This work is suitable for use as a showcase for brand landing pages and similar case studies.",
    "thumbnail": "yunfeis-choice/yunfeis-choice.jpg",
    "webUrl": "https://google.com"
  },
  {
    "url": "project-Malaysia.html",
    "name": "馬來西亞旅遊線上手冊",
    "nameEN": "Malaysia Online Tourism Manual",
    "summary": "此線上手冊以靜態網頁形式製作，具備 RWD 響應式設計，適應各種裝置瀏覽。內容製作技術包含 HTML 架構、CSS 樣式設計與完整圖片素材整合，展現視覺導向商品頁面的切版能力。設計素材由原設計方提供，本人負責靜態切版與前端動畫效果製作，適用於品牌形象網站、行銷導向頁面等展示類型專案。",
    "summaryEN": "This online guide was built as a static website with responsive web design (RWD) to ensure optimal viewing across various devices. The development process involved structured HTML, custom CSS styling, and full integration of visual assets, showcasing my ability to implement visually-driven layouts. While the design materials were provided by the original designer, I was responsible for front-end slicing and animation effects, making it suitable for brand identity pages and promotional site showcases.",
    "thumbnail": "ebbok_company/ebbok_company.jpg",
    "webUrl": "https://google.com"
  },
  {
    "url": "project-MobileBooking.html",
    "name": "手機訂房系統",
    "nameEN": "Mobile Booking System",
    "summary": "本作品為網站前端靜態頁面設計，自起初即針對手機平台開發，包含房間上架、價格設定、訂單與資料管理等功能頁。使用 HTML、CSS 製作，設計素材由設計方提供，本人負責靜態切版與頁面製作。",
    "summaryEN": "This is a static front-end project originally designed for mobile platforms, featuring pages for room listing, pricing, order, and data management. Built with HTML and CSS. Design assets were provided by the original designer; I was responsible for layout implementation and page development.",
    "thumbnail": "GuestHouse/GuestHouse.jpg",
    "webUrl": "https://google.com"
  },
  {
    "url": "project-AMHASystem.html",
    "name": "AMHA後台線上系統",
    "nameEN": "AMHA System Content Management System (CMS)",
    "summary": "本專案為亞洲惡性高熱聯盟（AMHA）後台管理系統，提供資料維護、內容編輯與基本資訊管理等功能。前端以 HTML 與 CSS 製作，搭配原設計方提供之視覺素材，由本人負責靜態切版與前端功能實作。整體設計以實用性為導向，適用於桌機環境下的後台操作與管理。",
    "summaryEN": "This project is the back-end management system for the Asia Malignant Hyperthermia Alliance (AMHA), supporting content editing, data maintenance, and general information management. The interface was developed using HTML and CSS, based on visual assets provided by the original designer. I was responsible for static layout implementation and front-end development. The system is designed for practical use and intended for desktop-based administrative operations.",
    "thumbnail": "AMHA_System/AMHA_System.jpg"
  },
  {
    "url": "project-ERPSystem.html",
    "name": "企業後台ERP系統",
    "nameEN": "ERP System Content Management System (CMS)",
    "summary": "本專案為企業後台 ERP 系統前端樣板，涵蓋飯店專案管理、訂單建立、價格與庫存查詢、供應商與導遊資料維護、系統公告等核心模組。系統介面以 HTML 與 CSS 製作，設計上著重使用者體驗（UX），特別針對桌機操作流程進行優化，讓管理人員在日常操作上更加直覺與高效。由設計方提供視覺素材，本人負責前端靜態切版與互動效果實作，展現企業後台系統在資訊整合與操作便利性的介面製作能力。",
    "summaryEN": "This project is a front-end template for an enterprise ERP back-end management system, featuring key modules such as hotel project management, order processing, price and inventory viewing, supplier and guide management, and system announcements. The interface was built using HTML and CSS, with a strong focus on user experience (UX). It is specifically optimized for desktop workflows, providing intuitive and efficient navigation for internal staff. Visual assets were provided by the original designer, while I was responsible for static layout implementation and front-end interaction effects, demonstrating my ability to deliver functional and user-friendly admin interfaces for enterprise environments.",
    "thumbnail": "ERP_System/ERP.jpg",
    "webUrl": "https://google.com"
  },
  {
    "url": "project-GuesthouseAdminSystem.html",
    "name": "旅宿業後台系統",
    "nameEN": "Guesthouse Admin System",
    "summary": "本專案為旅宿業所設計之後台管理系統前端樣板，功能涵蓋旅宿與房型管理、訂單查詢、推薦碼維護與銷售報表統計等模組。系統以靜態 HTML 與 CSS 製作，支援 RWD 響應式設計，確保在桌機與行動裝置上皆具良好操作體驗。操作介面提供管理者在不同設備上進行房型上架、價格設定與資料維護。設計素材由原設計方提供，本人負責切版與前端頁面整合，展現後台系統在功能性與跨裝置介面上的整合能力。",
    "summaryEN": "This project is a front-end template for a guesthouse management back-end system, featuring modules such as property and room listings, order tracking, referral code management, and sales reporting. Developed using static HTML and CSS, the system supports responsive web design (RWD), ensuring a seamless user experience across both desktop and mobile devices. The interface allows administrators to manage listings, pricing, and data maintenance efficiently on any platform. Visual design assets were provided by the original designer, while I was responsible for layout slicing and front-end integration, demonstrating capabilities in building functional and cross-device admin interfaces.",
    "thumbnail": "GuestHouse_System/GuestHouse_System.jpg",
    "webUrl": "https://google.com"
  }
]